$(function () {
    var line = new Highcharts.chart({
        chart: {
            renderTo: 'budgetAndUsage',
            spacingBottom: 15,
            spacingTop: 10,
            spacingLeft: 10,
            spacingRight: 10,
        },
        title: {
            /* Solar Employment Growth by Sector */
            text: 'งบประมาณของกระทรวงเกษตรและสหกรณ์ปีพ.ศ. 2547-2562'
        },

        subtitle: {
            text: 'ที่มาของข้อมูล: http://www.bb.go.th/web/budget/province/province_bud62/ หมายเหตุ : ข้อมูลในปี พ.ศ. 2555 ไม่มีข้อมูลของจังหวัดเพชรบุรี'
        },

        yAxis: {
            title: {
                text: 'ล้านบาท'
            }
        },

        legend: {
            layout: 'vertical',
            align: 'right',
            verticalAlign: 'middle'
        },

        xAxis: {
            title: {
                text: 'ปี'
            }
        },

        plotOptions: {
            series: {
                label: {
                    connectorAllowed: 0
                },
                pointStart: 2004 + 543
            }
        },

        series: [
            {
                name: 'งบประมาณรวม',
                data: [
                    763.882135, 934.586447, 713.637085,	1074.73902,
                    1311.62134,	1165.914098, 543.485415, 1023.243312,	
                    514.385499,	850.508956,	852.871288,	1360.215444,
                    1388.00012,	1182.1489,	1572.8989,	3546.2767
                ]

            },{
                name: 'สมุทรสาคร',
                data: [
                    177.282781,	245.12191,	229.73195,	166.051633,	119.871091,	221.647526,	64.74838,	70.538846,	93.175543,	57.787754,	94.353366,	167.846926,	234.14532,	135.3433,	366.0398,	555.0608

                ]
            },{
                name: 'สมุทรสงคราม',
                data: [
                    36.546906,32.55303,	34.96999,	35.661282,	30.877334,	34.307296,	23.84888,	46.479766,	39.91115,	32.57261,	38.140866,	66.23212,	69.80082,	37.7857,	54.9915,	120.0866
                ]
            },{
                name: 'เพชรบุรี',
                data: [
                    235.177526,	370.552272,	282.025015,	441.545035,	593.522074,	663.911902,	244.213205,	453.642168,	0,	269.996508,	454.010155,	585.520461,	570.32024,	501.5892,	635.6882,	1111.631
                ]
            },{
                name: 'ประจวบคีรีขันธ์',
                data: [
                    314.874922,	286.359235,	166.91013,	431.48107,	567.350841,	246.047374,	210.67495,	452.582532,	381.298806,	490.152084,	266.366901,	540.615937,	513.73374,	507.4307,	516.1794,	1759.4983
                ]
            },
        ],

        responsive: {
            rules: [{
                condition: {
                    maxWidth: 500
                },
                chartOptions: {
                    legend: {
                        layout: 'horizontal',
                        align: 'center',
                        verticalAlign: 'bottom'
                    }
                }
            }]
        }

    });
})

$(function () {
    var pie = new Highcharts.chart({
        chart: {
            styledMode: true,
            renderTo: 'pie',
            spacingBottom: 15,
            spacingTop: 10,
            spacingLeft: 10,
            spacingRight: 10,
            events: {
                redraw: function () {
                    setTimeout(function () {
                        label.fadeOut();
                    }, 1000);
                }
            }
        },

        title: {
            text: 'ส่วนแบ่งงบประมาณของแต่ละกรมในกระทรวงเกษตรและสหกรณ์โดยเฉลี่ย'
        },
        subtitle: {
            text: 'ที่มาของข้อมูล: http://www.bb.go.th/web/budget/province/province_bud62/'
        },
        xAxis: {},

        series: [{
            name: 'งบประมาณ',
            type: 'pie',
            allowPointSelect: true,
            data: [{
                    "name": "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์",
                    "y": 3459051.7
                },
                {
                    "name": "กรมชลประทาน",
                    "y": 146654581
                },
                {
                    "name": "กรมตรวจบัญชีสหกรณ์",
                    "y": 2419582
                },
                {
                    "name": "กรมประมง",
                    "y": 24606424
                },
                {
                    "name": "กรมปศุสัตว์",
                    "y": 2198103
                },
                {
                    "name": "กรมพัฒนาที่ดิน",
                    "y": 3075053
                },
                {
                    "name": "กรมส่งเสริมการเกษตร",
                    "y": 4663623
                },
                {
                    "name": "กรมส่งเสริมสหกรณ์",
                    "y": 3528481
                },
            ],
            showInLegend: true
        }],
    });
    $('#สมุทรสาคร').click(function () {
        var data = [{
            "name": "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์",
            "y": 3459051.7
        },
        {
            "name": "กรมชลประทาน",
            "y": 146654581
        },
        {
            "name": "กรมตรวจบัญชีสหกรณ์",
            "y": 2419582
        },
        {
            "name": "กรมประมง",
            "y": 24606424
        },
        {
            "name": "กรมปศุสัตว์",
            "y": 2198103
        },
        {
            "name": "กรมพัฒนาที่ดิน",
            "y": 3075053
        },
        {
            "name": "กรมส่งเสริมการเกษตร",
            "y": 4663623
        },
        {
            "name": "กรมส่งเสริมสหกรณ์",
            "y": 3528481
        },
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของจังหวัดสมุทรสาคร'
        })
    })
    $('#สมุทรสงคราม').click(function () {
        var data = [{
                "name": "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์",
                "y": 4604916.7
            },
            {
                "name": "กรมชลประทาน",
                "y": 24193900
            },
            {
                "name": "กรมตรวจบัญชีสหกรณ์",
                "y": 2074487
            },
            {
                "name": "กรมประมง",
                "y": 8423665
            },
            {
                "name": "กรมปศุสัตว์",
                "y": 1837514
            },
            {
                "name": "กรมพัฒนาที่ดิน",
                "y": 2480536
            },
            {
                "name": "กรมส่งเสริมการเกษตร",
                "y": 4467039
            },
            {
                "name": "กรมส่งเหสริมสหกรณ์",
                "y": 3512047
            },
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของจังหวัดสมุทรสงคราม'
        })
    })
    $('#เพชรบุรี').click(function () {
        var data = [{
                "name": "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์",
                "y": 4978828.643
            },
            {
                "name": "กรมชลประทาน",
                "y": 410115613
            },
            {
                "name": "กรมตรวจบัญชีสหกรณ์",
                "y": 5368478
            },
            {
                "name": "กรมประมง",
                "y": 18226834
            },
            {
                "name": "กรมปศุสัตว์",
                "y": 14065580
            },
            {
                "name": "กรมพัฒนาที่ดิน",
                "y": 14129648
            },
            {
                "name": "กรมวิชาการเกษตร",
                "y": 7298875
            },
            {
                "name": "กรมส่งเสริมการเกษตร",
                "y": 8806109
            },{
                "name": "กรมส่งเสริมสหกรณ์",
                "y": 11001020
            },
            {
                "name": "สำนักงานการปฏิรูปที่ดินเพื่อเกษตรกรรม",
                "y": 3106647
            },
            {
                "name": "กรมฝนหลวงและการบินเกษตร",
                "y": 10983333
            }
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของจังหวัดเพชรบุรี'
        })
    })
    $('#ประจวบคีรีขันธ์').click(function () {
        var data = [{
                "name": "สำนักงานปลัดกระทรวงเกษตรและสหกรณ์",
                "y": 3671481.2
            },
            {
                "name": "กรมชลประทาน",
                "y": 413320356
            },
            {
                "name": "กรมตรวจบัญชีสหกรณ์",
                "y": 4616471
            },
            {
                "name": "กรมประมง",
                "y": 11810188
            },
            {
                "name": "กรมปศุสัตว์",
                "y": 13310863
            },
            {
                "name": "กรมพัฒนาที่ดิน",
                "y": 15620631
            },
            {
                "name": "กรมส่งเสริมการเกษตร",
                "y": 8120567
            },
            {
                "name": "กรมส่งเสริมสหกรณ์",
                "y": 4178378
            },
            {
                "name": "สำนักงานการปฏิรูปที่ดินเพื่อเกษตรกรรม",
                "y": 3000744
            },
            {
                "name": "กรมฝนหลวงและการบินเกษตร",
                "y": 15391867
            }
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของจังหวัดประจวบคีรีขันธ์'
        })
    })
})

$(function () {
    var bar = new Highcharts.chart({
        chart: {
            type: 'column',
            renderTo: 'bar',
            spacingBottom: 15,
            spacingTop: 10,
            spacingLeft: 10,
            spacingRight: 10,
        },
        title: {
            text: 'งบประมาณของแต่ละกรมในเกษตรและสหกรณ์ในกลุ่มจังหวัดภาคกลางโดยเฉลี่ย'
        },
        subtitle: {
            text: 'ที่มาของข้อมูล: http://www.bb.go.th/web/budget/province/province_bud62/'
        },
        xAxis: {
            categories: [
                'สมุทรสาคร',
                'สมุทรสงคราม',
                'เพชรบุรี',
                'ประจวบคีรีขันธ์',
            ],
            crosshair: true
        },
        yAxis: {
            min: 0,
            title: {
                text: 'บาท'
            }
        },
        tooltip: {
            headerFormat: '<span style="font-size:10px">{point.key}</span><table>',
            pointFormat: '<tr><td style="color:{series.color};padding:0">{series.name}: </td>' +
                '<td style="padding:0"><b>{point.y:.1f} บาท</b></td></tr>',
            footerFormat: '</table>',
            shared: true,
            useHTML: true
        },
        plotOptions: {
            column: {
                pointPadding: 0.2,
                borderWidth: 0
            }
        },
        series: [{
            name: 'สำนักงานปลัดกระทรวงเกษตรและสหกรณ์',
            data: [359051.7, 4604916.7, 4978828.643, 3671481.2]

        }, {
            name: 'กรมชลประทาน',
            data: [146654581, 24193900, 410115613, 413320356]

        }, {
            name: 'กรมตรวจบัญชีสหกรณ์',
            data: [2419582.0, 2074487, 5368478, 4616471]

        }, {
            name: 'กรมประมง',
            data: [24606424.0, 8423665,18226834, 11810188]

        }, {
            name: 'กรมปศุสัตว์',
            data: [2198103, 1837514, 14065580, 13310863]

        }, {
            name: 'กรมพัฒนาที่ดิน',
            data: [ 3075053, 2480536, 14129648, 15620631]

        }, {
            name: 'กรมวิชาการเกษตร',
            data: [ 0 , 0, 7298875, 0]

        }, {
            name: 'กรมส่งเสริมการเกษตร',
            data: [4663623, 4467039, 8806109, 8120567]

        }, {
            name: 'กรมส่งเสริมสหกรณ์',
            data: [3528481, 3512047, 11001020, 4178378]

        }, {
            name: 'สำนักงานการปฏิรูปที่ดินเพื่อเกษตรกรรม',
            data: [0, 0, 3106647, 3000744]

        }, {
            name: 'กรมฝนหลวงและการบินเกษตร',
            data: [0, 0, 10983333,15391867]

        }]
    });
})